{
    "Title": "Withering Depths",
    "Months": "5 months",
    "Role": "Solo Dev",

    "Pitch_Title": "Pitch & fact sheet :",
    "Pitch_Text": "Play as Prea, a <strong>defenseless</strong> being trapped in the <strong>infected</strong> and <strong>hostile</strong> depths. Use the pheromones found in your environment to interact with various platforms. <br><br>Withering Depths is a <strong>PC platformer</strong> combining <strong>puzzles</strong> and \"<strong>die-and-retry</strong>\" gameplay, featuring a horizontal-scrolling camera. <br>The game design aims to evoke a sense of <strong>unknown</strong>, <strong>unpredictability</strong>, and <strong>hostility</strong>",

    "SumUp_Title": "In short :",
    "SumUp_Text": "Withering Depths was my first first-year project, and it allowed me to <strong>find my footing</strong> in several areas of game development, such as <strong>teamwork</strong> on a shared project, the <strong>Unity</strong> engine and <strong>C#</strong>. <br><br>It introduced me to the <strong>basics of gameplay design</strong> and taught me how to build a <strong>2D controller</strong>.<br><br>Project completed as part of my study at Rubika Valenciennes",

    "Realisation_Title": "My work on the project :",
    "Realisation_Text": "As the only programmer in the team, I was in charge of all the <strong>programming</strong> as well as some aspects of the <strong>game design</strong>. Here are some key points on this project :<br><br>•The <strong>2D controller</strong> : In order to get the specific feeling we were aiming for, the controller was developed <strong>entirely without using Unity’s Rigidbody</strong>, which was a <strong>significant challenge</strong> given my limited knowledge at the time. Using <strong>Raycasts</strong>, I implemented <strong>jump buffering</strong>, <strong>coyote time</strong> and a <strong>lateral offset system</strong> that slightly shifts the player when they hit the corner of a platform, allowing them to continue their jump if space permits.<br><br>•The <strong>UI and inputs</strong> : For maintainability, they were implemented using <strong>Unity's new input system</strong>.<br><br>• The <strong>cameras</strong> : We were aiming for a precise control over our camera behavior, which led to the creation of a <strong>custom camera script</strong>. Although simple, it allowed us to <strong>switch between cameras</strong> when entering trigger zones and to <strong>restrict the camera to predefined areas</strong>.<br><br>The <strong>gameplay elements</strong> : True to our concept, the mechanics were quite challenging to build as a beginner. Withering Depths features <strong>three platform types</strong>, each reacting differently to <strong>three distinct pheromones</strong> the player can switch between. Together, these systems created several technical challenges, such as <strong>dynamic state management</strong> and <strong>collision handling</strong>, made more difficult by the absence of a Rigidbody on the player.<br><br>•The <strong>save system</strong> : Since Withering Depths is partly a \"die-and-retry\", we implemented a system using <strong>PlayerPrefs</strong> to store the <strong>number of deaths</strong> and <strong>completion time</strong> for each level.",

    "Amelioration_Title": "Areas for improvment :",
    "Amelioration_Text": "One major mistake in this project was not using a <strong>Game Manager</strong> to centralize certain behaviors, which greatly <strong>reduced the readability and maintainability</strong> of my scripts. Due to my limited experience at the time, several elements, such as platform interactions, were poorly optimized or even <strong>placed in scripts that were not responsible for their logic</strong> such as implementing platform effects directly inside the controller script. <br><br>Another mistake comes from that same script: because it served as the main component, I invested a large portion of development time into it, which made it <strong>difficult to read in certain places</strong>. I did not yet understand the importance of <strong>splitting and structuring code</strong>, which resulted in the controller being contained in one large script.<br><br>However, these mistakes helped me understand the <strong>importance of clear architecture</strong> from the start of a project and pushed me to adopt <strong>more modular practices</strong> in my later work.",
    
    "Galery": "Gallery :"
}