{
    "Title": "Withering Depths",
    "Months": "5 mois",
    "Role": "Programmeur seul",

    "Pitch_Title": "Pitch & fiche signalétique :",
    "Pitch_Text": "Incarnez Préa, un <strong>être sans défense</strong> piégé dans les profondeurs <strong>infectées</strong> et <strong>hostiles</strong>. Utilisez des phéromones, présentes dans votre environnement pour interagir avec différentes plateformes. <br><br> Withering Depths est un <strong>plateformer PC</strong> alliant <strong>puzzles</strong> et \"<strong>die and retry</strong>\" avec une <strong>caméra en scrolling horizontal</strong>. <br>Le game designe est pensé pour créer un sentiment d'<strong>inconnu</strong>, <strong>d'imprévisibilité</strong> et d'<strong>hostilité</strong>.",

    "SumUp_Title": "En bref :",
    "SumUp_Text": "Withering Depths est mon premier projet de première année et c'est durant celui-ci que j'ai pu <strong>prendre mes marques</strong> dans plusieurs aspects de la production d'un jeu comme le <strong>travail en équipe</strong> sur un projet commun, le moteur <strong>Unity</strong> et le langage de programmation <strong>C#</strong>. <br><br> Ce fut une première expérience dans laquelle j'ai appris les <strong>bases de la conception gameplay</strong> et la gestion d'un <strong>contrôleur 2D</strong>. <br><br>Projet réalisé dans le cadre de mes études à Rubika Valenciennes.",

    "Realisation_Title": "Mes réalisations sur le projet :",
    "Realisation_Text": "En tant que seul programmeur de l'équipe, j'ai pris en charge tous les aspects de la <strong>programmation</strong>, tout en endossant également le rôle de <strong>game designer</strong> sur ce projet. Voici les points clefs de ce projet : <br><br>• Le <strong>contrôleur 2D</strong> : Pour obtenir le feeling spécifique, le contrôleur a entièrement été <strong>développé sans l'utilisation des RigidBody</strong> d'Unity, un <strong>défi conséquent</strong> compte tenu de mes connaissances limitées au début du projet. Grâce à l'utilisation de <strong>Raycasts</strong> j'ai pu intégrer, un <strong>jump buffering</strong>, un <strong>coyote time</strong>,  ainsi qu'un <strong>mécanisme de décalage latéral</strong> permettant, lorsque le joueur touche le coin d'une plateforme en sautant, de le déplacer légèrement sur le côté (si l'espace le permet) afin de prolonger son saut. <br><br>• Les <strong>UIs et Inputs</strong> : Par souci de maintenabilité, ils ont été réalisés à l'aide du <strong>nouveau Input System</strong> d'Unity. <br><br>• Les <strong>caméras</strong> : Nous recherchions un contrôle précis sur nos caméras, ce qui m'a amené à créer un <strong>script de caméra personnalisé</strong>. Ce système, bien que basique, permettait d'<strong>alterner entre différentes caméras</strong> lorsque le joueur entre dans des triggers, et de <strong>contraindre la position de la caméra</strong> dans une zone définie. <br><br>• Les <strong>éléments de gameplay</strong> : Fidèle à notre concept, les mécaniques étaient relativement complexes à réaliser pour un débutant. Withering Depths propose <strong>trois types de plateformes</strong>, chacune <strong>réagissant différemment à trois phéromones</strong> distinctes, entre lesquelles le joueur peut alterner. Ces deux éléments combinés impliquaient de nombreux défis techniques comme la <strong>gestion dynamique des états</strong> et des <strong>collisions</strong>, complexifiée par l'absence de RigidBody sur l'avatar joueur. <br><br>• <strong>Système de sauvegarde</strong> : Puisque Withering Depths est en partie un jeu \"die and retry\", nous avons souhaité implémenter un système sauvegardant dans les <strong>PlayerPrefs</strong> le nombre de morts et le temps nécessaire à la complétion d'un niveau.",

    "Amelioration_Title": "Axes d'Amélioration :",
    "Amelioration_Text": "Lors de ce projet, une des erreurs majeures a été de ne pas <strong>utiliser de Game Manager</strong> pour centraliser certaines parties de mes scripts, ce qui a grandement <strong>compliqué la relecture et la maintenance</strong> des différents composants. Par manque de connaissances, de nombreux éléments, comme les interactions avec les plateformes, étaient peu optimisés, voire <strong>placés dans des scripts qui ne sont pas responsables de leur logique</strong>, comme l'effet d'une plateforme intégré directement dans le script du contrôleur. Un dernier point faible réside dans ce même script. Étant le script principal, j'y ai consacré une grande partie de la production, ce qui le rend <strong>difficilement lisible par endroits</strong>. Je <strong>ne maîtrisais pas encore bien le principe de division du code</strong>, ce qui fait que l'intégralité du contrôleur est contenue dans ce seul script. <br><br> Ces erreurs m'ont cependant permis de comprendre l'<strong>importance d'une architecture claire</strong> dès le début d'un projet et m'ont poussé à <strong>adopter des pratiques plus modulaires</strong> dans mes travaux suivants.",
    
    "Galery": "Galerie :"
}